In [67]:
import pandas as pd
import numpy as np

In [8]:
path_death = 'causes_of_death.csv'

df_death = pd.read_csv(path_death)
df_death.head()

   Year  ZIP Code Causes of Death  Count                 Location
0  1999     90002             SUI      1   (33.94969, -118.246213)
1  1999     90005             HOM      1  (34.058508, -118.301197)
2  1999     90006             ALZ      1  (34.049323, -118.291687)
3  1999     90007             ALZ      1  (34.029442, -118.287095)
4  1999     90009             DIA      1      (33.9452, -118.3832)

In [107]:
path_income = 'irs_income_by_zip_code.csv'

df_income = pd.read_csv(path_income)
df_income.head()

,STATE,ZIPCODE,Number of returns,Adjusted gross income (AGI),Avg AGI,Number of returns with total income,Total income amount,Avg total income,Number of returns with taxable income,Taxable income amount,Avg taxable income
0,AL,0,2022380,105089761,51.963410,2022380,106420533,52.621433,1468370,67850874,46.208295
1,AL,35004,4930,255534,51.832454,4930,258024,52.337525,4020,163859,40.760945
2,AL,35005,3300,128387,38.905152,3300,129390,39.209091,2440,70760,29.000000
3,AL,35006,1230,58302,47.400000,1230,58585,47.630081,940,36341,38.660638
4,AL,35007,11990,643708,53.687073,11990,651350,54.324437,9280,414878,44.706681

In [106]:
df_death_final = df_death[['ZIP Code','Causes of Death','Count']]

In [105]:
df_income_final = df_income[['ZIPCODE', 'Avg AGI']]

In [104]:
df_max_Crime = grouped.groupby(['ZIP Code']).aggregate(np.max)

In [86]:
idx = df_death.groupby(['ZIP Code'])['Count'].transform(max) == df_death['Count']

In [103]:
di = df_death[idx]

df_u = di.drop_duplicates(subset=['ZIP Code', 'Count'], keep='first', inplace=False)
df_final = df_u.loc[df_u['Count'] > 20]
df_final = df_final[['ZIP Code', 'Causes of Death', 'Count']]
df_final.tail()

        ZIP Code Causes of Death  Count
231942     95608             HTD    249
231962     92543             HTD    292
231990     92653             HTD    380
231991     99998             HTD    388
232017     99999             OTH   1003

In [109]:
zip_num_death = df_death['ZIP Code'].nunique()
print(f"We have studied {zip_num_death} Zipcodes in the 'Cause of Death' DataFrame")

We have studied 1785 Zipcodes in the 'Cause of Death' DataFrame

In [111]:
diseases_total = df_death['Causes of Death'].nunique()
print(f"There are {diseases_total} unique diseases in the data-set")

There are 14 unique diseases in the data-set